Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
  #ifdef USES_ADS1220
    /*  Uses ADS1220 */
    loadcell = new LoadCell_ADS1220();

  #else
    /*  Uses ADS1256 */
    loadcell = new LoadCell_ADS1256();
  #endif

  

  loadcell->setLoadcellRating(dap_config_st_local.payLoadPedalConfig_.loadcell_rating);

  loadcell->estimateBiasAndVariance();       // automatically identify sensor noise for KF parameterization

	// find the min & max endstops
	Serial.println("Start homing");
	stepper->findMinMaxSensorless(dap_config_st_local);

 
  Serial.print("Min Position is "); Serial.println(stepper->getLimitMin());
  Serial.print("Max Position is "); Serial.println(stepper->getLimitMax());


  // setup Kalman filters
  // Serial.print("Given loadcell variance: ");
  // Serial.println(loadcell->getVarianceEstimate(), 5);
  kalman = new KalmanFilter(loadcell->getVarianceEstimate());
  kalman_joystick =new KalmanFilter(0.1f);
  kalman_2nd_order = new KalmanFilter_2nd_order(loadcell->getVarianceEstimate());


  // LED signal 
  #ifdef USING_LED
      //pixels.setBrightness(20);
      pixels.setPixelColor(0, 0x80, 0x00, 0x80);//purple
      pixels.show(); 
      //delay(3000);
  #endif

  

  // activate parameter update in first cycle
  configUpdateAvailable = true;

  // equalize pedal config for both tasks
  dap_config_st_local = global_dap_config_class.getConfig();


  // setup multi tasking
  semaphore_updateJoystick = xSemaphoreCreateMutex();
  semaphore_updatePedalStates = xSemaphoreCreateMutex();
  semaphore_updateLoadcellReading = xSemaphoreCreateMutex();
  semaphore_setSerialCommunicationSpeed = xSemaphoreCreateMutex();

  // setup binary semaphore for timer callback
  timer_firePedalUpdate = xSemaphoreCreateBinary();
  timer_fireJoystickUpdate = xSemaphoreCreateBinary();
  timer_fireSerialCommunication = xSemaphoreCreateBinary();
  // timer_fireLoadcellReadingReady = xSemaphoreCreateBinary();

  delay(10);


  if(semaphore_updateJoystick==NULL)
  {
    Serial.println("Could not create semaphore");
    ESP.restart();
  }


  disableCore0WDT();

  Serial.println("Starting other tasks");


  // // loadcell reading task
  // // 1. Define timer configuration
  // const esp_timer_create_args_t timer_args = {
  //     .callback = &timer_readLoadcell_callback, // Function to call
  //     .name = "loadcell_reading"    // A name for debugging
  // };

  // // 2. Create the timer handle
  // esp_timer_handle_t timer_handle_loadcellReading;
  // esp_timer_create(&timer_args, &timer_handle_loadcellReading);

  // // 3. Start the timer to fire periodically
  // // The second argument is the period in microseconds.
  // esp_timer_start_periodic(timer_handle_loadcellReading, PUT_TARGET_CYCLE_TIME_IN_US); 



  // pedal update task
  // 1. Define timer configuration
  const esp_timer_create_args_t timer_args_pedalUpdate = {
      .callback = &timer_pedalUpdate_callback, // Function to call
      .name = "pedal_update"    // A name for debugging
  };

  // 2. Create the timer handle
  esp_timer_handle_t timer_handle_pedalUpdate;
  esp_timer_create(&timer_args_pedalUpdate, &timer_handle_pedalUpdate);

  // 3. Start the timer to fire periodically
  // The second argument is the period in microseconds.
  esp_timer_start_periodic(timer_handle_pedalUpdate, 300); 
  // esp_timer_start_periodic(timer_handle_pedalUpdate, PUT_TARGET_CYCLE_TIME_IN_US); 



  // joystick update task
  // 1. Define timer configuration
  const esp_timer_create_args_t timer_args_joystickUpdate = {
      .callback = &timer_joystickUpdate_callback, // Function to call
      .name = "joystick_update"    // A name for debugging
  };

  // 2. Create the timer handle
  esp_timer_handle_t timer_handle_joystickUpdate;
  esp_timer_create(&timer_args_joystickUpdate, &timer_handle_joystickUpdate);

  // 3. Start the timer to fire periodically
  // The second argument is the period in microseconds.
  esp_timer_start_periodic(timer_handle_joystickUpdate, REPETITION_INTERVAL_JOYSTICKOUTPUT_TASK_IN_US); 





  // serial communication task
  // 1. Define timer configuration
  const esp_timer_create_args_t timer_args_serialCommunication = {
      .callback = &timer_serialCommunication_callback, // Function to call
      .name = "serial_communication"    // A name for debugging
  };

  // 2. Create the timer handle
  esp_timer_create(&timer_args_serialCommunication, &timer_handle_serialCommunication);

  // 3. Start the timer to fire periodically
  // The second argument is the period in microseconds.
  esp_timer_start_periodic(timer_handle_serialCommunication, REPETITION_INTERVAL_SERIALCOMMUNICATION_TASK_IN_US);






  //create a task that will be executed in the Task2code() function, with priority 1 and executed on core 1
  xTaskCreatePinnedToCore(
                    pedalUpdateTask,   /* Task function. */
                    "pedalUpdateTask",     /* name of task. */
                    7000,       /* Stack size of task */
                    //STACK_SIZE_FOR_TASK_1,
                    NULL,        /* parameter of the task */
                    10,           /* priority of the task */
                    &Task1,      /* Task handle to keep track of created task */
                    CORE_ID_PEDAL_UPDATE_TASK);          /* pin task to core 1 */
  delay(200);

  xTaskCreatePinnedToCore(
                    loadcellReadingTask,   /* Task function. */
                    "loadcellReadingTask",     /* name of task. */
                    3000,       /* Stack size of task */
                    //STACK_SIZE_FOR_TASK_1,
                    NULL,        /* parameter of the task */
                    9,           /* priority of the task */
                    &Task1,      /* Task handle to keep track of created task */
                    CORE_ID_LOADCELLREADING_TASK);          /* pin task to core 1 */
  delay(200);

  xTaskCreatePinnedToCore(
                    serialCommunicationTask,   
                    "serialCommunicationTask", 
                    5000,  
                    //STACK_SIZE_FOR_TASK_2,    
                    NULL,      
                    8,         
                    &Task2,    
                    CORE_ID_SERIAL_COMMUNICATION_TASK);     
  delay(200);

  xTaskCreatePinnedToCore(
                    joystickOutputTask,   
                    "joystickOutputTask", 
                    5000,  
                    //STACK_SIZE_FOR_TASK_2,    
                    NULL,      
                    7,         
                    &Task7,    
                    CORE_ID_JOYSTICK_TASK);     
  delay(200);
  xTaskCreatePinnedToCore(
                    miscTask,   
                    "miscTask", 
                    2000,  
                    //STACK_SIZE_FOR_TASK_2,    
                    NULL,      
                    1,         
                    &Task8,    
                    CORE_ID_MISC_TASK);     
  delay(200);



