Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
  dap_calculationVariables_st.updateFromConfig(dap_config_st_local);
  dap_calculationVariables_st.updateEndstops(stepper->getLimitMin(), stepper->getLimitMax());
  stepper->updatePedalMinMaxPos(dap_config_st_local.payLoadPedalConfig_.pedalStartPosition, dap_config_st_local.payLoadPedalConfig_.pedalEndPosition);
  dap_calculationVariables_st.updateStiffness();

  // tune the PID settings
  tunePidValues(dap_config_st_local);
}



/**********************************************************************************************/
/*                                                                                            */
/*                         Main function                                                      */
/*                                                                                            */
/**********************************************************************************************/
unsigned long joystick_state_last_update=millis();
void loop() {

  delay(5000);
  
  taskYIELD();
  /*
  #ifdef OTA_update
  server.handleClient();
  //delay(1);
  #endif
  */
  
  
}




/**********************************************************************************************/
/*                                                                                            */
/*                         pedal update task                                                  */
/*                                                                                            */
/**********************************************************************************************/
void IRAM_ATTR pedalUpdateTask( void * pvParameters )
{

  static DRAM_ATTR DAP_state_extended_st dap_state_extended_st_lcl_pedalUpdateTask;
  FunctionProfiler profiler_pedalUpdateTask;
  profiler_pedalUpdateTask.setName("PedalUpdate");
  float loadcellReading = 0.0f;
  float filteredReading_exp_filter = 0;
  unsigned long servoActionLast = millis();
  bool firstReadConfig=true;
  unsigned long debugMessageLast=0;

  uint32_t pos_printCount = 0;
  uint32_t controlTask_stackSizeIdx_u32 = 0;
  float previousLoadcellReadingInKg_fl32 = 0.0f;
 
  for(;;){

    // wait for the timer to fire
    // This will block until the timer callback gives the semaphore. It won't consume CPU time while waiting.
    if(timer_firePedalUpdate != NULL)
    {
      if (xSemaphoreTake(timer_firePedalUpdate, portMAX_DELAY) == pdTRUE) {

        // copy global struct to local for faster and safe executiion
        DAP_config_st dap_config_pedalUpdateTask_st = global_dap_config_class.getConfig();

        // activate profiler depending on pedal config
        if (dap_config_pedalUpdateTask_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_CYCLE_TIMER) 
        {
          profiler_pedalUpdateTask.activate( true );
        }
        else
        {
          profiler_pedalUpdateTask.activate( false );
        }


        // start profiler 0, overall function
        profiler_pedalUpdateTask.start(0);
        
        

        // system identification mode
        #ifdef ALLOW_SYSTEM_IDENTIFICATION
          if (systemIdentificationMode_b == true)
          {
            measureStepResponse(stepper, &dap_calculationVariables_st, &dap_config_pedalUpdateTask_st, loadcell);
            systemIdentificationMode_b = false;
          }
        #endif
      

        // if a config update was received over serial, update the variables required for further computation
        if (configUpdateAvailable == true)
        {
            bool configWasUpdated_b = false;
            // Take the semaphore and just update the config file, then release the semaphore
            
            Serial.println("Updating pedal config");
            configUpdateAvailable = false;

            // update the calc params
            Serial.println("Updating the calc params");
            configWasUpdated_b = false;
            //Serial.print("save to eeprom tag:");
            //Serial.println(dap_config_pedalUpdateTask_st.payLoadHeader_.storeToEeprom);
            if(firstReadConfig)
            {
              firstReadConfig=false;
            }
            else
            {
              previewConfigGet_b = true;
              saveToEEPRomDuration = millis();
            }
            
            if (true == dap_config_pedalUpdateTask_st.payLoadHeader_.storeToEeprom)
            {
              dap_config_pedalUpdateTask_st.payLoadHeader_.storeToEeprom = false; // set to false, thus at restart existing EEPROM config isn't restored to EEPROM
              uint16_t crc = checksumCalculator((uint8_t*)(&(dap_config_pedalUpdateTask_st.payLoadHeader_)), sizeof(dap_config_pedalUpdateTask_st.payLoadHeader_) + sizeof(dap_config_pedalUpdateTask_st.payLoadPedalConfig_));
              dap_config_pedalUpdateTask_st.payloadFooter_.checkSum = crc;

              global_dap_config_class.storeConfigToEprom();
              previewConfigGet_b = false;
              saveToEEPRomDuration = 0;
            }
            
            updatePedalCalcParameters(); // update the calc parameters
            moveSlowlyToPosition_b = true;
        }
        

        // print the execution time averaged over multiple cycles
        if (dap_config_pedalUpdateTask_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_CYCLE_TIMER) 
        {
          static CycleTimer timerPU("PU cycle time");
          timerPU.Bump();
        }

        //#define RECALIBRATE_POSITION
        #ifdef RECALIBRATE_POSITION
          stepper->checkLimitsAndResetIfNecessary();
        #endif


        // start profiler 1, effects
        profiler_pedalUpdateTask.start(1);


        // compute pedal oscillation, when ABS is active
        float absForceOffset = 0.0f;
        float absPosOffset = 0.0f;
        dap_calculationVariables_st.Default_pos();
        #ifdef ABS_OSCILLATION
          absOscillation.forceOffset(&dap_calculationVariables_st, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.absPattern, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.absForceOrTarvelBit, &absForceOffset, &absPosOffset);
          _RPMOscillation.trigger();
          _RPMOscillation.forceOffset(&dap_calculationVariables_st);
          _BitePointOscillation.forceOffset(&dap_calculationVariables_st);
          _G_force_effect.forceOffset(&dap_calculationVariables_st, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.G_multi);
          _WSOscillation.forceOffset(&dap_calculationVariables_st);
          _Road_impact_effect.forceOffset(&dap_calculationVariables_st, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.Road_multi);
          CV1.forceOffset(dap_config_pedalUpdateTask_st.payLoadPedalConfig_.CV_freq_1,dap_config_pedalUpdateTask_st.payLoadPedalConfig_.CV_amp_1);
          CV2.forceOffset(dap_config_pedalUpdateTask_st.payLoadPedalConfig_.CV_freq_2,dap_config_pedalUpdateTask_st.payLoadPedalConfig_.CV_amp_2);
          if(dap_calculationVariables_st.Rudder_status) 
          {
            _rudder.offset_calculate(&dap_calculationVariables_st);
            dap_calculationVariables_st.update_stepperMinpos(_rudder.offset_filter);
            _rudder_g_force.offset_calculate(&dap_calculationVariables_st);
            dap_calculationVariables_st.update_stepperMaxpos(_rudder_g_force.offset_filter);
          }
          if(dap_calculationVariables_st.helicopterRudderStatus) 
          {
            helicopterRudder_.offset_calculate(&dap_calculationVariables_st);
            dap_calculationVariables_st.update_stepperMinpos(helicopterRudder_.offset_filter);
          }
          #ifdef ESPNow_debug_rudder
            if(millis()-debugMessageLast>500)
            {
              debugMessageLast=millis();
              Serial.print("Center offset:");
              Serial.println(_rudder.offset_filter);
              Serial.print("min default:");
              Serial.println(dap_calculationVariables_st.stepperPosMin_default);
            }
          #endif

          //_rudder.force_offset_calculate(&dap_calculationVariables_st);

        #endif

        //update max force with G force effect
        movingAverageFilter.dataPointsCount = dap_config_pedalUpdateTask_st.payLoadPedalConfig_.G_window;
        movingAverageFilter_roadimpact.dataPointsCount = dap_config_pedalUpdateTask_st.payLoadPedalConfig_.Road_window;
        dap_calculationVariables_st.reset_maxforce();
        dap_calculationVariables_st.Force_Max += _G_force_effect.G_force;
        dap_calculationVariables_st.Force_Max += _Road_impact_effect.Road_Impact_force;
        dap_calculationVariables_st.dynamic_update();
        dap_calculationVariables_st.updateStiffness();
      
        // end profiler 1, effects
        profiler_pedalUpdateTask.end(1);

        // start profiler 2, loadcell reading
        profiler_pedalUpdateTask.start(2);

