Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
        // pedal not in action, disable pedal power
        uint32_t pedalIdleTimout = dap_config_pedalUpdateTask_st.payLoadPedalConfig_.servoIdleTimeout * 60 * 1000; // timeout in ms
        if ((stepper->servoStatus == SERVO_CONNECTED) && ((millis() - servoActionLast) > pedalIdleTimout) && (dap_config_pedalUpdateTask_st.payLoadPedalConfig_.servoIdleTimeout != 0))
        {
          stepper->servoIdleAction();
          stepper->servoStatus = SERVO_IDLE_NOT_CONNECTED;
          #ifdef USING_BUZZER
            Buzzer.single_beep_tone(770, 100);
          #endif
          delay(300);
          #ifdef USING_LED
            pixels.setPixelColor(0, 0xff, 0x00, 0x00); // show red
            pixels.show();
          #endif
          #ifdef USING_BUZZER
            Buzzer.single_beep_tone(770, 100);
          #endif
          Serial.println("Servo idle timeout reached. To restart pedal, please apply pressure.");
        }
        //emergency button

        #ifdef EMERGENCY_PIN
          if ((stepper->servoStatus == SERVO_CONNECTED) && (stepper->servoStatus != SERVO_FORCE_STOP) && (digitalRead(EMERGENCY_PIN) == LOW))
          {
            stepper->servoIdleAction();
            stepper->servoStatus = SERVO_FORCE_STOP;
            #ifdef USING_BUZZER
              Buzzer.single_beep_tone(770, 100);
            #endif
            delay(300);
            #ifdef USING_LED
              pixels.setPixelColor(0, 0xff, 0x00, 0x00); // show red
              pixels.show();
            #endif
            #ifdef USING_BUZZER
              Buzzer.single_beep_tone(770, 100);
            #endif
            Serial.println("Servo force Stoped.");
          }
        #endif
        //float FilterReadingJoystick=averagefilter_joystick.process(filteredReading);


        // start profiler 4, movement strategy
        profiler_pedalUpdateTask.start(5);


        float stepperPosFraction = stepper->getCurrentPositionFraction();
        int32_t Position_Next = 0;
        
        // select control loop algo
        switch (dap_config_pedalUpdateTask_st.payLoadPedalConfig_.control_strategy_b) {
          case 0:
            // static PID
            Position_Next = MoveByPidStrategy(filteredReading, stepperPosFraction, stepper, &forceCurve, &dap_calculationVariables_st, &dap_config_pedalUpdateTask_st, 0.0f/*effect_force*/, changeVelocity);
            break;
          case 1:
            // dynamic PID
            Position_Next = MoveByPidStrategy(filteredReading, stepperPosFraction, stepper, &forceCurve, &dap_calculationVariables_st, &dap_config_pedalUpdateTask_st, 0.0f/*effect_force*/, changeVelocity);
            break;
          default:
            // MPC
            Position_Next = MoveByForceTargetingStrategy(filteredReading, stepper, &forceCurve, &dap_calculationVariables_st, &dap_config_pedalUpdateTask_st, 0.0f/*effect_force*/, changeVelocity, d_phi_d_x, d_x_hor_d_phi);
            // Position_Next = MoveByForceTargetingStrategy_old(filteredReading, stepper, &forceCurve, &dap_calculationVariables_st, &dap_config_pedalUpdateTask_st, 0/*effect_force*/, changeVelocity, d_phi_d_x, d_x_hor_d_phi);
            break;
        }

        // end profiler 4, movement strategy
        profiler_pedalUpdateTask.end(5);

        // start profiler 6, ...
        profiler_pedalUpdateTask.start(6);

        // float alphaPidOut = 0.9;
        // Position_Next = Position_Next*alphaPidOut + Position_Next_Prev * (1.0f - alphaPidOut);
        // Position_Next_Prev = Position_Next;

        // add dampening
        if (dap_calculationVariables_st.dampingPress  > 0.0001f)
        {
          // dampening is proportional to velocity --> D-gain for stability
          Position_Next -= dap_calculationVariables_st.dampingPress * changeVelocity * dap_calculationVariables_st.springStiffnesssInv;
        }
          


        // clip target position to configured target interval with RPM effect movement in the endstop
        Position_Next = (int32_t)constrain(Position_Next, dap_calculationVariables_st.stepperPosMin, dap_calculationVariables_st.stepperPosMax);
        
      
        // //Adding effects
        //Add effect by force
        float effect_force = _BitePointOscillation.BitePoint_Force_offset + _WSOscillation.WS_Force_offset + CV1.CV_Force_offset + CV2.CV_Force_offset;

        if(filteredReading>=dap_calculationVariables_st.Force_Min)
        {
          Position_Next -= absPosOffset;
          effect_force += absForceOffset;
        }
        int32_t Position_effect= effect_force/dap_calculationVariables_st.Force_Range*dap_calculationVariables_st.stepperPosRange;
        Position_Next -=_RPMOscillation.RPM_position_offset;

        Position_Next -= Position_effect;
        Position_Next = (int32_t)constrain(Position_Next, dap_calculationVariables_st.stepperPosMinEndstop, dap_calculationVariables_st.stepperPosMaxEndstop);
        
        //bitepoint trigger
        int32_t BP_trigger_value = dap_config_pedalUpdateTask_st.payLoadPedalConfig_.BP_trigger_value;
        int32_t BP_trigger_min = (BP_trigger_value-4);
        int32_t BP_trigger_max = (BP_trigger_value+4);
        int32_t Position_check = 100*((Position_Next-dap_calculationVariables_st.stepperPosMin) / dap_calculationVariables_st.stepperPosRange);
        int32_t Rudder_real_poisiton= 100*((Position_Next-dap_calculationVariables_st.stepperPosMin_default) / dap_calculationVariables_st.stepperPosRange_default);

        dap_calculationVariables_st.current_pedal_position = Position_Next;
        dap_calculationVariables_st.current_pedal_position_ratio=((float)(dap_calculationVariables_st.current_pedal_position-dap_calculationVariables_st.stepperPosMin_default))/((float)dap_calculationVariables_st.stepperPosRange_default);
        //Rudder initialzing and de initializing
        #ifdef ESPNOW_Enable
          if(dap_calculationVariables_st.Rudder_status)
          {
            if(Rudder_initializing)
            {
              moveSlowlyToPosition_b=true;
              //Serial.println("moving to center");
            }
            if(Rudder_initializing && (Rudder_real_poisiton<52 && Rudder_real_poisiton>48))
            {
              if(Rudder_initialized_time==0)
              {
                Rudder_initialized_time=millis();
              }
              else
              {
                unsigned long Rudder_initialzing_time_Now = millis();
                //wait 3s for the initializing
                //Serial.print("Rudder initializing...");
                //Serial.println(Rudder_initialzing_time_Now-Rudder_initialized_time);
                if( (Rudder_initialzing_time_Now-Rudder_initialized_time)> Rudder_timeout )
                {
                  Rudder_initializing=false;
                  moveSlowlyToPosition_b=false;
                  Serial.println("Rudder initialized");
                  dap_calculationVariables_st.isRudderInitialized=true;
                  Rudder_initialized_time=0;
                  #ifdef USING_BUZZER
                    Buzzer.play_melody_tone(melody_Airship_theme, sizeof(melody_Airship_theme)/sizeof(melody_Airship_theme[0]),melody_Airship_theme_duration);
                  #endif
                }
              }
              

