Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
            }
          }
          if(Rudder_deinitializing)
          {
            moveSlowlyToPosition_b=true;
            //Serial.println("moving to min end stop");
          }
          if(Rudder_deinitializing && (Rudder_real_poisiton< 2 ))
          {
            Rudder_deinitializing=false;
            moveSlowlyToPosition_b=false;
            Serial.println("Rudder deinitialized");
            dap_calculationVariables_st.isRudderInitialized=false;
          }
          //helicopter rudder initialzied
          if(dap_calculationVariables_st.helicopterRudderStatus)
          {
            if(HeliRudder_initializing)
            {
              moveSlowlyToPosition_b=true;
              //Serial.println("moving to center");
            }
            if(HeliRudder_initializing && (Rudder_real_poisiton<52 && Rudder_real_poisiton>48))
            {
              if(Rudder_initialized_time==0)
              {
                Rudder_initialized_time=millis();
              }
              else
              {
                unsigned long Rudder_initialzing_time_Now = millis();
                //wait 3s for the initializing
                //Serial.print("Rudder initializing...");
                //Serial.println(Rudder_initialzing_time_Now-Rudder_initialized_time);
                if( (Rudder_initialzing_time_Now-Rudder_initialized_time)> Rudder_timeout )
                {
                  HeliRudder_initializing=false;
                  moveSlowlyToPosition_b=false;
                  Serial.println("HeliRudder initialized");
                  dap_calculationVariables_st.isHelicopterRudderInitialized=true;
                  Rudder_initialized_time=0;
                  #ifdef USING_BUZZER
                    Buzzer.play_melody_tone(melodyAirwolfTheme, sizeof(melodyAirwolfTheme)/sizeof(melodyAirwolfTheme[0]),melodyAirwolfThemeDuration);
                  #endif
                }
              }
            }
          }
          if(HeliRudder_deinitializing)
          {
            moveSlowlyToPosition_b=true;
              //Serial.println("moving to min end stop");
          }
          if(HeliRudder_deinitializing && (Rudder_real_poisiton< 2 ))
          {
            HeliRudder_deinitializing=false;
            moveSlowlyToPosition_b=false;
            Serial.println("HeliRudder deinitialized");
            dap_calculationVariables_st.isHelicopterRudderInitialized=false;
          }
        #endif

        //Serial.println(Position_check);
        if(dap_config_pedalUpdateTask_st.payLoadPedalConfig_.BP_trigger==1)
        {
          if(Position_check > BP_trigger_min)
          {
            if(Position_check < BP_trigger_max)
            {
              _BitePointOscillation.trigger();
            }
          }
        }

        // if pedal in min position, recalibrate position --> automatic step loss compensation
        stepper->configSteplossRecovAndCrashDetection(dap_config_pedalUpdateTask_st.payLoadPedalConfig_.stepLossFunctionFlags_u8);
        if (stepper->isAtMinPos())
        {
          #if defined(OTA_update_ESP32) || defined(OTA_update)
            if(OTA_status==false)
            {
              stepper->correctPos();
            }
          #else
            stepper->correctPos();
          #endif
        }

        // set position command smoothing
        stepper->configSetPositionCommandSmoothingFactor(dap_config_pedalUpdateTask_st.payLoadPedalConfig_.positionSmoothingFactor_u8);

        // reset all servo alarms
        if ( (dap_config_pedalUpdateTask_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_RESET_ALL_SERVO_ALARMS) )
        {
          Serial.println("Set clear alarm history flag");
          stepper->clearAllServoAlarms();
          delay(1000); // makes sure the routine has finished

          DAP_config_st tmp = global_dap_config_class.getConfig();
          tmp.payLoadPedalConfig_.debug_flags_0 &= ( ~(uint8_t)DEBUG_INFO_0_RESET_ALL_SERVO_ALARMS); // clear the debug bit
          global_dap_config_class.setConfig(tmp);

        }

        // print all servo parameters for debug purposes
        if ( (dap_config_pedalUpdateTask_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_LOG_ALL_SERVO_PARAMS) )
        {
          DAP_config_st tmp = global_dap_config_class.getConfig();
          tmp.payLoadPedalConfig_.debug_flags_0 &= ( ~(uint8_t)DEBUG_INFO_0_LOG_ALL_SERVO_PARAMS); // clear the debug bit
          global_dap_config_class.setConfig(tmp);

          delay(1000);  
          stepper->printAllServoParameters();
        }


        // Move to new position
        if (!moveSlowlyToPosition_b)
        {
          #if defined(OTA_update_ESP32) || defined(OTA_update)
            if(OTA_status==false)
            {
              stepper->moveTo(Position_Next, false);
            }
          #else
            stepper->moveTo(Position_Next, false);
          #endif
        }
        else
        {
          #if defined(OTA_update_ESP32) || defined(OTA_update)
            if(OTA_status==false)
            {
              moveSlowlyToPosition_b = false;
              stepper->moveSlowlyToPos(Position_Next);
            }
          #else
            moveSlowlyToPosition_b = false;
            stepper->moveSlowlyToPos(Position_Next);
          #endif

        }
      


        
        
        

        // compute controller output
        dap_calculationVariables_st.StepperPos_setback();
        dap_calculationVariables_st.reset_maxforce();
        dap_calculationVariables_st.dynamic_update();
        dap_calculationVariables_st.updateStiffness();
        

        // set joystick value
        if(semaphore_updateJoystick!=NULL)
        {
          if(xSemaphoreTake(semaphore_updateJoystick, (TickType_t)1)==pdTRUE) {
            float joystickNormalizedToInt32_orig=0.0f;
            float joystickfrac =0.0f;
            float joystickNormalizedToInt32_eval=0.0f;
            if(dap_calculationVariables_st.Rudder_status&&dap_calculationVariables_st.rudder_brake_status)
            {
              if (1 == dap_config_pedalUpdateTask_st.payLoadPedalConfig_.travelAsJoystickOutput_u8)
              {
                joystickNormalizedToInt32_orig = NormalizeControllerOutputValue((Position_Next-dap_calculationVariables_st.stepperPosRange/2), dap_calculationVariables_st.stepperPosMin, dap_calculationVariables_st.stepperPosMin+dap_calculationVariables_st.stepperPosRange/2.0f, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.maxGameOutput);
                //joystickNormalizedToInt32 = constrain(joystickNormalizedToInt32,0,JOYSTICK_MAX_VALUE);
              }
              else
              {
                joystickNormalizedToInt32_orig = NormalizeControllerOutputValue((FilterReadingJoystick/*filteredReading*/), dap_calculationVariables_st.Force_Min, dap_calculationVariables_st.Force_Max, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.maxGameOutput);
                //joystickNormalizedToInt32 = constrain(joystickNormalizedToInt32,0,JOYSTICK_MAX_VALUE);
              }
            }
            else
            {
              if (1 == dap_config_pedalUpdateTask_st.payLoadPedalConfig_.travelAsJoystickOutput_u8)
              {
                joystickNormalizedToInt32_orig = NormalizeControllerOutputValue(Position_Next, dap_calculationVariables_st.stepperPosMin, dap_calculationVariables_st.stepperPosMax, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.maxGameOutput);
              }
              else
              {            
                joystickNormalizedToInt32_orig = NormalizeControllerOutputValue(FilterReadingJoystick/*filteredReading*/, dap_calculationVariables_st.Force_Min, dap_calculationVariables_st.Force_Max, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.maxGameOutput);
              }
            }
            joystickfrac=(float)joystickNormalizedToInt32_orig/(float)JOYSTICK_MAX_VALUE;
            joystickNormalizedToInt32_eval = forceCurve.EvalJoystickCubicSpline(&dap_config_pedalUpdateTask_st, &dap_calculationVariables_st, joystickfrac);
            joystickNormalizedToInt32 = joystickNormalizedToInt32_eval/100.0f* JOYSTICK_MAX_VALUE;
            joystickNormalizedToInt32 = constrain(joystickNormalizedToInt32,0,JOYSTICK_MAX_VALUE);
            xSemaphoreGive(semaphore_updateJoystick);
          }
        }
        else
        {
          semaphore_updateJoystick = xSemaphoreCreateMutex();
        }

        // provide joystick output on PIN
        #ifdef Using_analog_output
          int dac_value=(int)(joystickNormalizedToInt32*255/10000);
          dacWrite(D_O,dac_value);
        #endif

        #ifdef Using_analog_output_ESP32_S3
          if(MCP_status)
          {
            int dac_value=(int)(joystickNormalizedToInt32*4096*0.9/10000);//limit the max to 5V*0.9=4.5V to prevent the overvolatage
            dac.setVoltage(dac_value, false);
          }
        #endif

        
        float normalizedPedalReading_fl32 = 0.0f;
        if ( fabs(dap_calculationVariables_st.Force_Range) > 0.01f)
        {
            normalizedPedalReading_fl32 = constrain((filteredReading - dap_calculationVariables_st.Force_Min) / dap_calculationVariables_st.Force_Range, 0.0f, 1.0f);
        }
        
        // simulate ABS trigger 
        if(dap_config_pedalUpdateTask_st.payLoadPedalConfig_.Simulate_ABS_trigger==1)
        {
          int32_t ABS_trigger_value=dap_config_pedalUpdateTask_st.payLoadPedalConfig_.Simulate_ABS_value;
          if( (normalizedPedalReading_fl32*100.0f) > ABS_trigger_value)
          {
            absOscillation.trigger();
          }
        }

        // end profiler 6, ...
        profiler_pedalUpdateTask.end(6);


        // start profiler 6, struct exchange
        profiler_pedalUpdateTask.start(7);

        // update extended pedal structures
        static DRAM_ATTR DAP_state_extended_st dap_state_extended_st_lcl_pedalUpdateTask;

