Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
        // print profiler results
        profiler_pedalUpdateTask.report();
      
      }
    }

  }
}

  






/**********************************************************************************************/
/*                                                                                            */
/*                         joystick output task                                               */
/*                                                                                            */
/**********************************************************************************************/
void IRAM_ATTR joystickOutputTask( void * pvParameters )
{ 
  int32_t joystickNormalizedToInt32_local = 0;

  FunctionProfiler profiler_joystickOutputTask;
  profiler_joystickOutputTask.setName("JoystickOutput");
  profiler_joystickOutputTask.setNumberOfCalls(500);


  for(;;){


    // wait for the timer to fire
    // This will block until the timer callback gives the semaphore. It won't consume CPU time while waiting.
    if(timer_fireJoystickUpdate != NULL)
    {
      if (xSemaphoreTake(timer_fireJoystickUpdate, portMAX_DELAY) == pdTRUE) {

        // copy global struct to local for faster and safe executiion
        DAP_config_st jut_dap_config_st = global_dap_config_class.getConfig();

        // activate profiler depending on pedal config
        if (jut_dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_CYCLE_TIMER) 
        {
          profiler_joystickOutputTask.activate( true );
        }
        else
        {
          profiler_joystickOutputTask.activate( false );
        }

        // start profiler 0, overall function
        profiler_joystickOutputTask.start(0);


        // obtain joystick output level
        if(semaphore_updateJoystick!=NULL)
        {
          if(xSemaphoreTake(semaphore_updateJoystick, (TickType_t)1)==pdTRUE)
          {
            //Serial.print(" 3");
            joystickNormalizedToInt32_local = joystickNormalizedToInt32;
            xSemaphoreGive(semaphore_updateJoystick);
          }
        }


        // send joystick output
        #if defined(USB_JOYSTICK) || defined(BLUETOOTH_GAMEPAD)
          if (IsControllerReady()) 
          {
            if(dap_calculationVariables_st.Rudder_status==false)
            {
              //general output
              SetControllerOutputValue(joystickNormalizedToInt32_local);
              
              #ifdef USB_JOYSTICK
                // Restart HID output if faulty behavior was detected
                JoystickSendState();
                if(!GetJoystickStatus())
                {
                  RestartJoystick();
                  Serial.println("HID Error, Restart Joystick...");
                  //last_serial_joy_out=millis();
                }
              #endif

            }
          }
        #endif


        // start profiler 0, overall function
        profiler_joystickOutputTask.end(0);

        profiler_joystickOutputTask.end(0);

        // print profiler results
        profiler_joystickOutputTask.report();

        // print the execution time averaged over multiple cycles
        if (jut_dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_CYCLE_TIMER) 
        {
          static CycleTimer timerJoystick("Joystick cycle time");
          timerJoystick.Bump();
        }
      }
    }
  }
}

/**********************************************************************************************/
/*                                                                                            */
/*                         communication task                                                 */
/*                                                                                            */
/**********************************************************************************************/
uint32_t communicationTask_stackSizeIdx_u32 = 0;
void IRAM_ATTR serialCommunicationTask( void * pvParameters )
{ 
  int32_t joystickNormalizedToInt32_local = 0;
  FunctionProfiler profiler_serialCommunicationTask;
  profiler_serialCommunicationTask.setName("SerialCommunication");
  profiler_serialCommunicationTask.setNumberOfCalls(500);

  unsigned long previousTimeInUsFromExtendedStruct_u32 = 0;
  unsigned long printCycleCounter = 0;

  for(;;){

    DAP_config_st sct_dap_config_st = global_dap_config_class.getConfig();

    if ( (sct_dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_STATE_EXTENDED_INFO_STRUCT) )
    {
      serialCommunicationTask_is_fast_period = true;
    }
    else
    {
      serialCommunicationTask_is_fast_period = false;          
    }

    if (serialCommunicationTask_is_fast_period_prev != serialCommunicationTask_is_fast_period)
    {
      // Stop the timer before changing its period.
      esp_timer_stop(timer_handle_serialCommunication);

      if (serialCommunicationTask_is_fast_period) {
        esp_timer_start_periodic(timer_handle_serialCommunication, REPETITION_INTERVAL_SERIALCOMMUNICATION_TASK_FAST_IN_US);
        Serial.println("Setting serial communication task to 200us");
        serialCommunicationTask_is_fast_period_prev = true;
      } else {
        esp_timer_start_periodic(timer_handle_serialCommunication, REPETITION_INTERVAL_SERIALCOMMUNICATION_TASK_IN_US);
        Serial.println("Setting serial communication task to 10ms");
        serialCommunicationTask_is_fast_period_prev = false;
      }
    }



    // wait for the timer to fire
    // This will block until the timer callback gives the semaphore. It won't consume CPU time while waiting.
    if(timer_fireSerialCommunication != NULL)
    {
      if (xSemaphoreTake(timer_fireSerialCommunication, portMAX_DELAY) == pdTRUE) {

        // average cycle time averaged over multiple cycles 
        if (sct_dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_CYCLE_TIMER) 
        {
          static CycleTimer timerSC("SC cycle time");
          timerSC.Bump();
        }

        // activate profiler depending on pedal config
        if (sct_dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_CYCLE_TIMER) 
        {
          profiler_serialCommunicationTask.activate( true );
        }
        else
        {
          profiler_serialCommunicationTask.activate( false );
        }


