Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
            }
          }


          // start profiler 1, serial read
          profiler_serialCommunicationTask.end(1);

          // start profiler 2, serial send
          profiler_serialCommunicationTask.start(2);


          // send pedal state structs
          // update pedal states
          printCycleCounter++;
          DAP_state_basic_st dap_state_basic_st_lcl;
          DAP_state_extended_st dap_state_extended_st_lcl;
            
          // initialize with zeros in case semaphore couldn't be aquired
          memset(&dap_state_basic_st_lcl, 0, sizeof(dap_state_basic_st_lcl));
          memset(&dap_state_extended_st_lcl, 0, sizeof(dap_state_extended_st_lcl));


          if(semaphore_updatePedalStates!=NULL)
          {
            
            if(xSemaphoreTake(semaphore_updatePedalStates, (TickType_t)5)==pdTRUE) 
            {
            
              // UPDATE basic pedal state struct
              dap_state_basic_st_lcl = dap_state_basic_st;

              // UPDATE extended pedal state struct
              dap_state_extended_st_lcl = dap_state_extended_st;
                
              // release semaphore
              xSemaphoreGive(semaphore_updatePedalStates);

            }
          }

          
          // end profiler 2, serial send
          profiler_serialCommunicationTask.end(2);

          // end profiler 2, serial send
          profiler_serialCommunicationTask.start(3);


          // send the pedal state structs
          // send basic pedal state struct
          if ( !(sct_dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_STATE_BASIC_INFO_STRUCT) )
          {
            if (printCycleCounter >= 2)
            {
              printCycleCounter = 0;

              // update CRC before transmission
              dap_state_basic_st_lcl.payloadFooter_.checkSum = checksumCalculator((uint8_t*)(&(dap_state_basic_st_lcl.payLoadHeader_)), sizeof(dap_state_basic_st_lcl.payLoadHeader_) + sizeof(dap_state_basic_st_lcl.payloadPedalState_Basic_));
          
              Serial.write((char*)&dap_state_basic_st_lcl, sizeof(DAP_state_basic_st));
              Serial.flush();
          
              // Serial.print("\r\n");
            }
          }

          if ( (sct_dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_STATE_EXTENDED_INFO_STRUCT) )
          {
            // only send, when extended struct contains updated values
            if( dap_state_extended_st_lcl.payloadPedalState_Extended_.timeInUs_u32 != previousTimeInUsFromExtendedStruct_u32)
            {
              previousTimeInUsFromExtendedStruct_u32 = dap_state_extended_st_lcl.payloadPedalState_Extended_.timeInUs_u32;

              //dap_state_extended_st_lcl.payloadPedalState_Extended_.timeInUsFromSerialTask_u32 = micros();

              // update CRC before transmission
              dap_state_extended_st_lcl.payloadFooter_.checkSum = checksumCalculator((uint8_t*)(&(dap_state_extended_st_lcl.payLoadHeader_)), sizeof(dap_state_extended_st_lcl.payLoadHeader_) + sizeof(dap_state_extended_st_lcl.payloadPedalState_Extended_));

              Serial.write((char*)&dap_state_extended_st_lcl, sizeof(DAP_state_extended_st));
              // Serial.print("\r\n");
              Serial.flush();
            }
          }

        }


        #ifdef PRINT_TASK_FREE_STACKSIZE_IN_WORDS
          if( communicationTask_stackSizeIdx_u32 == 1000)
          {
            UBaseType_t stackHighWaterMark = uxTaskGetStackHighWaterMark(NULL);
            Serial.print("StackSize (Serial communication): ");
            Serial.println(stackHighWaterMark);
            communicationTask_stackSizeIdx_u32 = 0;
          }
          communicationTask_stackSizeIdx_u32++;
        #endif

        // end profiler 3, serial send
        profiler_serialCommunicationTask.end(3);

        profiler_serialCommunicationTask.end(0);

        // print profiler results
        profiler_serialCommunicationTask.report();
      }
    }
  }
}



//OTA multitask
uint16_t OTA_count=0;
bool message_out_b=false;
bool OTA_enable_start=false;
uint32_t otaTask_stackSizeIdx_u32 = 0;
int OTA_update_status=99;
void OTATask( void * pvParameters )
{

  for(;;)
  {
    
    if(OTA_count>200)
    {
      message_out_b=true;
      OTA_count=0;
    }
    else
    {
      OTA_count++;
    }

    #if defined(OTA_update)  || defined(OTA_update_ESP32)
    if(OTA_enable_b)
    {
      if(message_out_b)
      {
        message_out_b=false;
        Serial1.println("OTA enable flag on");
      }
      if(OTA_status)
      {
        #ifdef OTA_update_ESP32
          server.handleClient();
        #endif
        #ifdef OTA_update
          if(OTA_update_status==0)
          {
            #ifdef USING_BUZZER
              Buzzer.play_melody_tone(melody_victory_theme, sizeof(melody_victory_theme)/sizeof(melody_victory_theme[0]),melody_durations_Victory_theme);              
            #endif
            ESP.restart();
          }
          else
          {
            #ifdef USING_BUZZER
              Buzzer.single_beep_tone(770,100);
            #endif
            #ifdef USING_LED
            pixels.setPixelColor(0,0xff,0x00,0x00);//red
            pixels.show(); 
            delay(500);
            pixels.setPixelColor(0,0x00,0x00,0x00);//no color
            pixels.show();
            delay(500);    
            #endif 
          }

        #endif
        

      }
      else
      {
        Serial.println("de-initialize espnow");
        Serial.println("wait...");
        #ifdef ESPNOW_Enable
          esp_err_t result= esp_now_deinit();
          ESPNow_initial_status=false;
          ESPNOW_status=false;
        #else
          esp_err_t result = ESP_OK;
        #endif
        delay(3000);
        if(result==ESP_OK)
        {
          OTA_status=true;
          #ifdef USING_BUZZER
            Buzzer.single_beep_tone(700,100);
          #endif 
          delay(1000);
          #ifdef OTA_update_ESP32
          ota_wifi_initialize(APhost);
          #endif
          #ifdef USING_LED
              //pixels.setBrightness(20);
              pixels.setPixelColor(0,0x00,0x00,0xff);//Blue
              pixels.show(); 
              //delay(3000);
          #endif
          #ifdef OTA_update
          wifi_initialized(SSID,PASS);
          delay(2000);
          ESP32OTAPull ota;
          int ret;
          ota.SetCallback(OTAcallback);
          ota.OverrideBoard(CONTROL_BOARD);
          char* version_tag;
          if(_dap_OtaWifiInfo_st.wifi_action==1)
          {
            const char* str ="0.0.0";
            version_tag=new char[strlen(str) + 1];
            strcpy(version_tag, str);
            Serial.println("Force update");
          }
          else
          {
            version_tag=new char[strlen(DAP_FIRMWARE_VERSION) + 1];
            strcpy(version_tag, DAP_FIRMWARE_VERSION);
            //version_tag=DAP_FIRMWARE_VERSION;
          }
          switch (_dap_OtaWifiInfo_st.mode_select)
          {
            case 1:
              Serial.printf("Flashing to latest Main, checking %s to see if an update is available...\n", JSON_URL_main);
              ret = ota.CheckForOTAUpdate(JSON_URL_main, version_tag, ESP32OTAPull::UPDATE_BUT_NO_BOOT);
              Serial.printf("CheckForOTAUpdate returned %d (%s)\n\n", ret, errtext(ret));
              OTA_update_status=ret;
              break;
            case 2:
              Serial.printf("Flashing to latest Dev, checking %s to see if an update is available...\n", JSON_URL_dev);
              ret = ota.CheckForOTAUpdate(JSON_URL_dev, version_tag, ESP32OTAPull::UPDATE_BUT_NO_BOOT);
              Serial.printf("CheckForOTAUpdate returned %d (%s)\n\n", ret, errtext(ret));
              OTA_update_status=ret;
              break;
            case 3:
              Serial.printf("Flashing to Daily build, checking %s to see if an update is available...\n", JSON_URL_dev);
              ret = ota.CheckForOTAUpdate(JSON_URL_daily, version_tag, ESP32OTAPull::UPDATE_BUT_NO_BOOT);
              Serial.printf("CheckForOTAUpdate returned %d (%s)\n\n", ret, errtext(ret));
              OTA_update_status=ret;
              break;
            default:
            break;
            delete[] version_tag; 
          }
          #endif

