Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
          delay(3000);
        }

      }
    }
    
    delay(1);
    #endif

    #ifdef PRINT_TASK_FREE_STACKSIZE_IN_WORDS
      if( otaTask_stackSizeIdx_u32 == 1000)
      {
        UBaseType_t stackHighWaterMark = uxTaskGetStackHighWaterMark(NULL);
        Serial.print("StackSize (OTA): ");
        Serial.println(stackHighWaterMark);
        otaTask_stackSizeIdx_u32 = 0;
      }
      otaTask_stackSizeIdx_u32++;
    #endif
    delay(2);
  }
}

#ifdef ESPNOW_Enable
int ESPNOW_count=0;
int error_count=0;
int print_count=0;
int ESPNow_no_device_count=0;
bool basic_state_send_b=false;
bool extend_state_send_b=false;
uint8_t error_out;

int64_t timeNow_espNowTask_l = 0;
int64_t timePrevious_espNowTask_l = 0;
#define REPETITION_INTERVAL_ESPNOW_TASK (int64_t)2

uint Pairing_timeout=20000;
uint rudderPacketInterval=3;
uint joystickPacketInterval=2;
bool Pairing_timeout_status=false;
bool building_dap_esppairing_lcl =false;
unsigned long Pairing_state_start;
unsigned long Pairing_state_last_sending;
unsigned long Debug_rudder_last=0;
unsigned long basic_state_update_last=0;
unsigned long extend_state_update_last=0;
unsigned long rudderPacketsUpdateLast=0;
unsigned long joystickPacketsUpdateLast=0;
uint32_t espNowTask_stackSizeIdx_u32 = 0;
void ESPNOW_SyncTask( void * pvParameters )
{
  for(;;)
  {
    //if(ESPNOW_status)

    // measure callback time and continue, when desired period is reached
    timeNow_espNowTask_l = millis();
    int64_t timeDiff_espNowTask_l = ( timePrevious_espNowTask_l + REPETITION_INTERVAL_ESPNOW_TASK) - timeNow_espNowTask_l;
    uint32_t targetWaitTime_u32 = constrain(timeDiff_espNowTask_l, 0, REPETITION_INTERVAL_ESPNOW_TASK);
    delay(targetWaitTime_u32); 
    timePrevious_espNowTask_l = millis();


    //restart from espnow
    if(ESPNow_restart)
    {
      Serial.println("ESP restart by ESP now request");
      ESP.restart();
    }

    
    //basic state sendout interval
    //if(ESPNOW_count%9==0)
    if(millis()-basic_state_update_last>3)
    {
      basic_state_send_b=true;
      basic_state_update_last=millis();
      
    }

    DAP_config_st espnow_dap_config_st = global_dap_config_class.getConfig();

    //entend state send out interval
    if((millis()-extend_state_update_last>10) && espnow_dap_config_st.payLoadPedalConfig_.debug_flags_0 == DEBUG_INFO_0_STATE_EXTENDED_INFO_STRUCT)
    {
      extend_state_send_b=true;
      extend_state_update_last=millis();
      
    }

    
    ESPNOW_count++;
    if(ESPNOW_count>10000)
    {
      ESPNOW_count=0;
    }
    
    if(ESPNow_initial_status==false  )
    {
      if(OTA_enable_b==false)
      {
        ESPNow_initialize();
      }
      
    }
    else
    {
      #ifdef ESPNow_Pairing_function
       #ifdef Hardware_Pairing_button
        if(digitalRead(Pairing_GPIO)==LOW)
        {
          hardware_pairing_action_b=true;
        }
       #endif
        if(hardware_pairing_action_b||software_pairing_action_b)
        {
          Serial.println("Pedal Pairing.....");
          delay(1000);
          Pairing_state_start=millis();
          Pairing_state_last_sending=millis();
          ESPNow_pairing_action_b=true;
          building_dap_esppairing_lcl=true;
          software_pairing_action_b=false;
          hardware_pairing_action_b=false;
          
        }
        if(ESPNow_pairing_action_b)
        {
          unsigned long now=millis();
          //sending package
          if(building_dap_esppairing_lcl)
          {
            uint16_t crc=0;          
            building_dap_esppairing_lcl=false;
            dap_esppairing_lcl.payloadESPNowInfo_._deviceID = espnow_dap_config_st.payLoadPedalConfig_.pedal_type;
            dap_esppairing_lcl.payLoadHeader_.payloadType = DAP_PAYLOAD_TYPE_ESPNOW_PAIRING;
            dap_esppairing_lcl.payLoadHeader_.PedalTag = espnow_dap_config_st.payLoadPedalConfig_.pedal_type;
            dap_esppairing_lcl.payLoadHeader_.version = DAP_VERSION_CONFIG;
            crc = checksumCalculator((uint8_t*)(&(dap_esppairing_lcl.payLoadHeader_)), sizeof(dap_esppairing_lcl.payLoadHeader_) + sizeof(dap_esppairing_lcl.payloadESPNowInfo_));
            dap_esppairing_lcl.payloadFooter_.checkSum=crc;
          }
          if(now-Pairing_state_last_sending>400)
          {
            Pairing_state_last_sending=now;
            ESPNow.send_message(broadcast_mac,(uint8_t *) &dap_esppairing_lcl, sizeof(dap_esppairing_lcl));
          }

          

          //timeout check
          if(now-Pairing_state_start>Pairing_timeout)
          {
            ESPNow_pairing_action_b=false;
            Serial.print("Pedal: ");
            Serial.print(espnow_dap_config_st.payLoadPedalConfig_.pedal_type);
            Serial.println(" timeout.");
            #ifdef USING_BUZZER
              Buzzer.single_beep_tone(700,100);
            #endif 
            if(UpdatePairingToEeprom)
            {
              EEPROM.put(EEPROM_offset,_ESP_pairing_reg);
              EEPROM.commit();
              UpdatePairingToEeprom=false;
              //list eeprom
              ESP_pairing_reg ESP_pairing_reg_local;
              EEPROM.get(EEPROM_offset, ESP_pairing_reg_local);
              for(int i=0;i<4;i++)
              {
                if(ESP_pairing_reg_local.Pair_status[i]==1)
                {
                  Serial.print("#");
                  Serial.print(i);
                  Serial.print("Pair: ");
                  Serial.print(ESP_pairing_reg_local.Pair_status[i]);
                  Serial.printf(" Mac: %02X:%02X:%02X:%02X:%02X:%02X\n", ESP_pairing_reg_local.Pair_mac[i][0], ESP_pairing_reg_local.Pair_mac[i][1], ESP_pairing_reg_local.Pair_mac[i][2], ESP_pairing_reg_local.Pair_mac[i][3], ESP_pairing_reg_local.Pair_mac[i][4], ESP_pairing_reg_local.Pair_mac[i][5]);
                }
              }
              //adding peer
              
              for(int i=0; i<4;i++)
              {
                if(_ESP_pairing_reg.Pair_status[i]==1)
                {
                  if(i==0)
                  {
                    ESPNow.remove_peer(Clu_mac);
                    memcpy(&Clu_mac,&_ESP_pairing_reg.Pair_mac[i],6);
                    delay(100);
                    ESPNow.add_peer(Clu_mac);
                    
